tiborsimon/embedded-tdd-headers/pic/8bit/pic18f13k22_tdd.h
#define SSPSTAT                       522
#define BF                            523
#define UA                            524
#define R_NOT_W                       525
#define NOT_W                         526
#define nW                            527
#define RW                            528
#define nWRITE                        529
#define R                             530
#define W                             531
#define NOT_WRITE                     532
#define R_nW                          533
#define R_W                           534
#define START                         535
#define S                             536
#define STOP                          537
#define P                             538
#define A                             539
#define NOT_A                         540
#define nA                            541
#define D_A                           542
#define D_nA                          543
#define D                             544
#define DA                            545
#define D_NOT_A                       546
#define NOT_ADDRESS                   547
#define nADDRESS                      548
#define CKE                           549
#define SMP                           550
#define T2CON                         551
#define T2CKPS0                       552
#define T2CKPS                        553
#define T2CKPS1                       554
#define TMR2ON                        555
#define T2OUTPS0                      556
#define T2OUTPS                       557
#define T2OUTPS1                      558
#define T2OUTPS2                      559
#define T2OUTPS3                      560
#define PR2                           561
#define WM0                           562
#define WM1                           563
#define WAIT0                         564
#define WAIT1                         565
#define EBDIS                         566
#define T1CON                         567
#define TMR1ON                        568
#define TMR1CS                        569
#define NOT_T1SYNC                    570
#define T1SYNC                        571
#define nT1SYNC                       572
#define T1OSCEN                       573
#define SOSCEN                        574
#define T1CKPS0                       575
#define T1CKPS                        576
#define T1CKPS1                       577
#define T1RUN                         578
#define T1CON_RD16                    579
#define T1RD16                        580
#define RCON                          581
#define BOR                           582
#define NOT_BOR                       583
#define nBOR                          584
#define POR                           585
#define nPOR                          586
#define NOT_POR                       587
#define PD                            588
#define nPD                           589
#define NOT_PD                        590
#define NOT_TO                        591
#define nTO                           592
#define TO                            593
#define nRI                           594
#define NOT_RI                        595
#define RI                            596
#define SBOREN                        597
#define IPEN                          598
#define WDTCON                        599
#define SWDTE                         600
#define SWDTEN                        601
#define OSCCON2                       602
#define LFIOFS                        603
#define HFIOFL                        604
#define PRI_SD                        605
#define OSCCON                        606
#define SCS0                          607
#define SCS                           608
#define SCS1                          609
#define FLTS                          610
#define HFIOFS                        611
#define OSTS                          612
#define IRCF                          613
#define IRCF0                         614
#define IRCF1                         615
#define IRCF2                         616
#define IDLEN                         617
#define T0CON                         618
#define T0PS                          619
#define T0PS0                         620
#define T0PS1                         621
#define T0PS2                         622
#define PSA                           623
#define T0SE                          624
#define T0CS                          625
#define T08BIT                        626
#define TMR0ON                        627
#define STATUS                        628
#define C                             629
#define CARRY                         630
#define DC                            631
#define ZERO                          632
#define Z                             633
#define OV                            634
#define OVERFLOW                      635
#define N                             636
#define NEGATIVE                      637
#define INTCON3                       638
#define INT1IF                        639
#define INT1F                         640
#define INT2IF                        641
#define INT2F                         642
#define INT1E                         643
#define INT1IE                        644
#define INT2IE                        645
#define INT2E                         646
#define INT1P                         647
#define INT1IP                        648
#define INT2IP                        649
#define INT2P                         650
#define INTCON2                       651
#define RABIP                         652
#define RBIP                          653
#define TMR0IP                        654
#define INTEDG2                       655
#define INTEDG1                       656
#define INTEDG0                       657
#define nRABPU                        658
#define NOT_RABPU                     659
#define NOT_RBPU                      660
#define nRBPU                         661
#define RABPU                         662
#define INTCON                        663
#define RABIF                         664
#define RBIF                          665
#define INT0F                         666
#define INT0IF                        667
#define T0IF                          668
#define TMR0IF                        669
#define RABIE                         670
#define RBIE                          671
#define INT0E                         672
#define INT0IE                        673
#define T0IE                          674
#define TMR0IE                        675
#define PEIE                          676
#define PEIE_GIEL                     677
#define PIE                           678
#define GIEL                          679
#define GIE_GIEH                      680
#define GIE                           681
#define GIEH                          682
#define SP0                           683
#define STKPTR                        684
#define SP1                           685
#define SP2                           686
#define SP3                           687
#define SP4                           688
#define STKUNF                        689
#define STKOVF                        690
#define STKFUL                        691

#endif // _PIC18F13K22_H_
